{
  "Name": "Lucas Łyskawa<div class=\"navbar-collapse collapse\">Android Developer</div>",
  "Navigation":{
    "Projects": "Projects",
    "Certificates": "Certificates",
    "Contact": "Contact"
  },
  "Projects":[
    "<p style=\"text-align: left;\">When I started workign in di-support, a subcontractor that created the app using Apache Cordova was asked to rewrite it in native.<br>It was a challenge for me to try and race their development. In spite of good results and quick work, after estimating the time requirement to finish the job, my work was cancelled due to time constraints.</p><p style=\"text-align: left;\">After the process of acquiring the first production ready version along with documentation, in which I also took part, I began to dive into the code and learn the architecture. In the meanwhile, as updates appeared, I prepared reports, changelogs and reviewed the code.<br>My extra responsibility was to find and report as many bugs as possible that were to be found in code and runtime.</p><p style=\"text-align: left;\">From time to time I also had to modify or help out with the PHP middleware service</p><p style=\"text-align: left;\">I took over the bugfixing and development, as soon as version 3.0.9 arrived.The most important improvements that were added by me include, but are not limited to (in non-chronological order):</p><ul style=\"text-align: left;\"><li>Mixed product basket</li><li>Changed the rendering, order preparing and sending process for the new middleware</li><li>Loading huge bitmaps by scaling them down to a desired output size</li><li>Extended the photo print product editor with multiformat option</li><li>Extended store finder with google maps</li><li>Rebuilt view creation and navigation (limiting their parameter dependencies)</li><li>Added a version check (blocking old versions - configurable)</li><li>Code obfuscation</li><li>Remodelled the configuration file structure</li><li>Drag & Drop - Reordering photo book pages</li><li>Added Retro photo product (Canvas rendering)</li><li>Tracking</li><li>Added and configured Continuous Integration (Gitlab CI)</li><li>Updating deprecated/old libraries (gradle, support, adobe editor)</li><li>Supporting latest Android versions (min. API 16)</li></ul><p style=\"text-align: left;\">...</p><p style=\"text-align: left;\">Besides working with Android apps, I also had various responsibilities and tasks, most of which are written on my linked in page in the job description</p>",
    "<p style=\"text-align: left;\">System consists of a database, two WPF applications, an ASP.NET MVC website and two services (WCF and RESTful) which allow for communication between the apps and the database.The projects was created in Scrum framework with three other developers and ended up as our engineer degree project. I was responsible for the WCF Web service and the Doctor's WPF application, that handled:<ul style=\"text-align: left;\"><li>Displaying the state of registered patients' queue for currently logged in user/doctor</li><li>Saving and printing visit's details</li><li>Browsing patient's medical history</li><li>Filling out and printing prescriptions</li></ul></p>",
    "<p style=\"text-align: left;\">Easy arcade game created for Windows Phone 8.1. The project was managed by Whalla Labs and developed by a team of two programmers and one graphic designer. We were assigned by our mentors the task of creating a new version of the existing Android game named \"Magic Square Rush\". We also had the freedom to improve it, which resulted in implementing additional gameplay difficulties. Although it is a Universal Apps project,  our team was only responsible for the 'Windows Phone' version of the game.</p></div>",
    "<p style=\"text-align: left;\">Application created for Project Sin social club for the purpose of easy and unbiased creation of random and fair skill-based teams for a game. Contestants registered their participation via Google Forms. The application is reading data with Google Api and creates parametrized teams while using random data provided by Random.org. Full code is available on my GitHub profile.</p>"
  ],
  "Docs":{
    "PDF": "doc/Łukasz Łyskawa cv eng.pdf",
    "DOCX": "doc/Łukasz Łyskawa cv eng.docx"
  },
  "Bio":
     "<p>I have started my programming education with Pascal. After grasping the essentials, C language sparked my interest as a better structuralized language that became more natural to me. As years flew by I gained basic Object Oriented Programming knowledge in C++ and Java at the same time creating basic user interfaces.</p><p>While studying at Collegium Da Vinci I discovered interesting aspects involving low-level programming including assembly and high-level programming with C# and Java focused on mobile systems (Windows Phone and Android).</p><p>Acquiring the knowledge of Windows Phone native application structure and view building using XAML, allowed me to discover that WPF is very similar and I gained interest in developing WPF applications. My professors, being such great specialists and teachers, passed on their knowledge of architectural patterns such as MVVM and MVP and shown me the applications of singletons and containers, unearthing a different aspect of programming style which is S.O.L.I.D.</p><p> Our student group, while focused on learning teamwork and practical skills, formed teams with varying programming skills and interests to tackle problems. A couple of times, we competed in Poznań Game Jam, however without being much successful.</p>"
}