{
  "Name": "Łukasz Łyskawa<div class=\"navbar-collapse collapse\">Android Developer</div>",
  "Navigation":{
    "Projects": "Projekty",
    "Certificates": "Certyfikaty",
    "Contact": "Kontakt"
  },
  "Projects":[
    "<p style=\"text-align: left;\">Gdy zacząłem pracować w firmie di-support, podwykonawca który wcześniej tworzył tą aplikację w technologii Apache-Cordova, otrzymał zlecenie na napisanie jej w wersji natywnej.<br>Miałem szansę przez kilka miesięcy spróbować dogonić tą firmę, ale pomimo dobrych rezultatów nie wystarczyłoby czasu na dokończenie mojej wersji w wymaganym terminie.</p><p style=\"text-align: left;\">Po przyjęciu projektu przez naszą firmę, w zabiegu któym również brałem udział, zacząłem poznawać kod i architekturę aplikacji, oraz w między czasie sporządzałem raporty z code review kolejnych aktualizacji.<br>Dodatkowo moje zadanie polegało na znajdywaniu i zgłaszaniu jak największej ilości błędów w samym działaniu aplikacji.</p><p style=\"text-align: left;\">Moje prace wiązały się również z modyfikacją kodu w serwisie middleware, napisanym w PHP.</p><p style=\"text-align: left;\">Wraz z wersją 3.0.9, czyli ostatnią aktualizacją podwykonawcy, sam zająłem się naprawianiem i wprowadzaniem nowych funkcji.Do listy (w kolejnosci niechronologicznej) największych zmian należą:</p><ul style=\"text-align: left;\"><li>Zamawianie kilku produktów na raz</li><li>Zmiana sposobu renderowania, przygotowywania i wysyłania obrazów na nowy serwis middleware</li><li>Skalowanie w dół ogromnych bitmap (wg konfiguracji produktu)</li><li>Rozbudowanie ekranu photoprint o \"multiformat\"</li><li>Rozszerzenie ekranu szukania sklepów (lista) o mapę</li><li>Przebudowanie ekranów i nawigacji (zwiększanie niezależności od parametrów)</li><li>Wprowadzenie kontroli wersji (blokowanie wybranych wersji)</li><li>Dodanie obfuskacji kodu</li><li>Zmiana struktury pliku konfiguracyjnego</li><li>Drag & Drop w edytorze Photobook</li><li>Dodanie produktu Retro photo</li><li>Tracking</li><li>Dodanie i skonfigurowanie Continuous Integration (Gitlab CI)</li><li>Aktualizowanie starych bibliotek (gradle, support, adobe editor)</li><li>Wspieranie najnowszych systemów Android</li></ul><p style=\"text-align: left;\">...</p><p style=\"text-align: left;\">Oprócz pracy związanej stricte z Androidem i aplikacją Fotowelt, miałem dużo innych obowiązków i zajęć, które wymienione są w opisie stanowiska na linked in.</p>",
    "<p style=\"text-align: left;\">System składa się z bazy danych, dwóch aplikacji WPF, strony internetowej ASP.NET, oraz serwisu WCF i dwóch REST odpowiedzialnych za komunikację między aplikacjami i bazą. Napisany wspólnie w systemie SCRUM z trzema innymi osobami jako praca dyplomowa. Byłem odpowiedzialny za serwis WCF oraz aplikację wspomagającą pracę lekarza, która obsługiwała:<ul style=\"text-align: left;\"><li>Wyświetlanie aktualnego stanu kolejki pacjentów zarejestrowanych do zalogowanego lekarza</li><li>Zapisywanie i drukowanie szczegółów wizyty</li><li>Przeglądanie historii choroby umówionego pacjenta</li><li>Wypisywanie i drukowanie recepty</li></ul></p>",
    "<p style=\"text-align: left;\">Prosta zręcznościowa gra na telefon Windows Phone. Projekt realizowany na praktykach w firmie Whalla Labs w 2-osobowym zespole programistów. Zadaniem było stworzenie wersji gry na telefon Windows Phone, uwzględniając pierwowzór na platformę Android o tej samej nazwie. Rozgrywka została rozbudowana o dodatkowe stopnie trudności. Aplikacja została zaprojektowana jako projekt Universal Apps, z możliwością stworzenia wersji na tablety i Windows (Metro), która została dokończona przez zespół Whalla Labs.</p></div>",
    "<p style=\"text-align: left;\">Aplikacja stworzona na potrzeby portalu Project Sin do tworzenia losowych drużyn. Chętni zgłaszali swoje uczestwictwo poprzez formularz Google Forms. Program odczytuje dane za pośrednictwem Google Api i tworzy n-osobowe drużyny według ustawień korzystając z losowego ciągu pobieranego ze strony Random.org. Pełny kod dostępny na GitHubie.</p>"
  ],
  "Docs":{
    "PDF": "doc/Łukasz Łyskawa cv.pdf",
    "DOCX": "doc/Łukasz Łyskawa cv.docx"
  },    
  "Bio":
     "<p>Moją naukę programowania rozpocząłem w szkole średniej od języka Pascal (2007 r.). Dopiero następny język C rozbudził moje zainteresowanie tą dyscypliną Informatyki. Przez kolejne lata uzyskiwałem podstawowe umiejętności programowania w językach Java i C++, gdzie rozpocząłem pisanie programów z warstwą graficzną (Windows Forms). </p><p>Po rozpoczęciu studiów w CDV (byłe WSNHiD) poznałem ciekawsze zaganienia związane z niskopoziomowym programowaniem w C i asemblerze oraz wysokopoziomowym – C# i Java ukierunkowanych na platformy mobilne (Windows Phone i Android).</p><p>We własnym zakresie odkryłem podobieństwo w WPF i technologii Windows Phone, co pozwoliło mi łatwo sobie większość informacji i zauważyć różnice między nimi.</p><p>Wykładowcy będący świetnymi praktykami przyswoili i zachęcili mnie do poznawania wzorców architektonicznych takich jak MVVM i MVP oraz pokazali takie struktury jak Singleton i kontenery odkrywając odmienne spojrzenie na sposób programowania jakim jest S.O.L.I.D.</p><p>Szkoła kładła duży nacisk na pracę w grupie i umiejętności praktyczne, zachęcając nas do tworzenia zespołów, w skład których wchodziły osoby z różnym stopniem umiejętności w programowaniu, ale też projektowania, czy grafiki.</p><p>Zaowocowało to między innymi powstaniu zespołów działających poza zajęciami szkolnymi i przez dwa lata z rzędu brałem udział w Poznań Game Jam, chociaż bez większych sukcesów.</p>"
}